База_Back/src/Documents/ОтусСписаниеБонусов/ОтусСписаниеБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтусСписаниеБонусов</name>
  <registerRecords>AccumulationRegister.отусБалансВиртуальныхКарт</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Карты</name>
    <attributes>
      <name>ВиртуальнаяКарта</name>
      <type>
        <types>CatalogRef.отусВиртуальныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

База_Back/src/Documents/ОтусСписаниеБонусов/ManagerModule.bsl
Функция СоздатьДокументСписания(Мкарты) Экспорт
	
	СписаниеБонусов = Документы.ОтусСписаниеБонусов.СоздатьДокумент(); 
	СписаниеБонусов.Дата = ТекущаяДатаСеанса();
	СписаниеБонусов.УстановитьНовыйНомер();
	СписаниеБонусов.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	СписаниеБонусов.Комментарий = СтрШаблон("Списание бонусов от %1", ТекущаяДатаСеанса());
	
	Для каждого ДанныеКарты Из Мкарты Цикл
		
		Карта = СписаниеБонусов.Карты.Добавить();
		Карта.ВиртуальнаяКарта = ДанныеКарты.Карта;
		Карта.Сумма = ДанныеКарты.Сумма;
		
	КонецЦикла;
	
	Попытка
		СписаниеБонусов.Записать(РежимЗаписиДокумента.Проведение); 
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;	
	
КонецФункции
